НВ_Доработки/Catalogs/НВД_Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НВД_Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

НВ_Доработки/Catalogs/НВД_Периоды/Ext/ManagerModule.bsl
// Процедура переподчинения и реструктуризации периодов.
//
Процедура РеструктурироватьПериоды(Родитель=Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Периоды.Ссылка КАК Период,
	|	Периоды.Родитель КАК Родитель,
	|	ВложенныйЗапрос.Ссылка КАК ПериодРодитель,
	|	ВложенныйЗапрос.РазностьДат КАК РазностьДат
	|ИЗ
	|	Справочник.НВД_Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Периоды.Ссылка КАК Ссылка,
	|			Периоды.ДатаНачала КАК ДатаНачала,
	|			Периоды.ДатаОкончания КАК ДатаОкончания,
	|			Периоды.Периодичность КАК Периодичность,
	|			РАЗНОСТЬДАТ(Периоды.ДатаНачала, Периоды.ДатаОкончания, ДЕНЬ) КАК РазностьДат
	|		ИЗ
	|			Справочник.НВД_Периоды КАК Периоды
	|		ГДЕ
	|			(НЕ Периоды.Произвольный)
	|			И (НЕ Периоды.ПометкаУдаления)
//	|			И (НЕ Периоды.Периодичность=&ДевятьМесяцев)
	|"+?(НЕ Родитель=Неопределено,"И Периоды.Родитель В ИЕРАРХИИ(&Родитель)","")+") КАК ВложенныйЗапрос
	|		ПО Периоды.ДатаНачала >= ВложенныйЗапрос.ДатаНачала
	|			И Периоды.ДатаОкончания <= ВложенныйЗапрос.ДатаОкончания
	|			И Периоды.Периодичность <> ВложенныйЗапрос.Периодичность
	|ГДЕ
	|	(НЕ Периоды.Произвольный)
	|	И (НЕ Периоды.ПометкаУдаления)
	|	И (НЕ ВложенныйЗапрос.Ссылка ЕСТЬ NULL )
	|"+?(НЕ Родитель=Неопределено,"И Периоды.Родитель В ИЕРАРХИИ(&Родитель)","")+"
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	РазностьДат";
	
	Запрос.УстановитьПараметр("Родитель",Родитель);
	//Запрос.УстановитьПараметр("ДевятьМесяцев",Перечисления.Периодичность.ДевятьМесяцев);
	
	ТекПериод=Неопределено;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Если НЕ Результат.Период=ТекПериод Тогда
			
			ТекПериод=Результат.Период;
			
			Если НЕ Результат.Родитель=Результат.ПериодРодитель Тогда
				
				ПериодОбъект=Результат.Период.ПолучитьОбъект();
				ПериодОбъект.Родитель=Результат.ПериодРодитель;
				ПериодОбъект.ОбменДанными.Загрузка=Истина;
				ПериодОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

// Функция выполняет создание дочерних периодов по родителю
// 
Функция СоздатьПериоды(Родитель, ЗаполняемыеПериоды) Экспорт
	
	Если ЗаполняемыеПериоды.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Периоды.Ссылка,
	             |	Периоды.ДатаНачала,
	             |	Периоды.Периодичность
	             |ИЗ
	             |	Справочник.НВД_Периоды КАК Периоды
	             |ГДЕ
	             |	Периоды.Родитель В ИЕРАРХИИ(&Родитель)
	             |	И Периоды.Периодичность В(&Периодичность)";
				 
	Запрос.УстановитьПараметр("Родитель",Родитель);
	Запрос.УстановитьПараметр("Периодичность",ЗаполняемыеПериоды);
	
	Результат=Запрос.Выполнить().Выгрузить();
	
	Для Каждого Периодичность ИЗ ЗаполняемыеПериоды Цикл
		
		ДатаНачала = Родитель.ДатаНачала;
		
		Пока ДатаНачала <= Родитель.ДатаОкончания Цикл
			
			СтруктураПоиска=Новый Структура;
			СтруктураПоиска.Вставить("ДатаНачала",ДатаНачала);
			СтруктураПоиска.Вставить("Периодичность",Периодичность);
			
			МассивСуществующих=Результат.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСуществующих.Количество()=0 Тогда
				
				Объект = Справочники.НВД_Периоды.СоздатьЭлемент();
				Объект.Родитель   = Родитель;
				Объект.ДатаНачала = ДатаНачала;
				Объект.Периодичность = Периодичность;
				Объект.Заполнить(Неопределено);
				
				Объект.ОбменДанными.Загрузка=Истина;
				
				Попытка
					Объект.Записать();
				Исключение
					НВД_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
				
				Ссылка = Объект.Ссылка;
				
			Иначе
				
				Ссылка=МассивСуществующих[0].Ссылка;
				
			КонецЕсли; 
			
			//Если Периодичность=Перечисления.Периодичность.ДевятьМесяцев Тогда
			//	Прервать;
			//Иначе
				ДатаНачала = НачалоДня(НВД_ОбщегоНазначения.ДобавитьДень(Ссылка.ДатаОкончания, 1));
//			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	РеструктурироватьПериоды(Родитель);
	
	Возврат Истина;
	
КонецФункции

Функция ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность, УстановитьДату = Истина) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 12) - 1);
	//ИначеЕсли Периодичность =Перечисления.Периодичность.ДевятьМесяцев Тогда
	//	ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 9) - 1);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 6) - 1);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 3) - 1);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 1) - 1);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Декада Тогда
		
		Если День(ДатаНачала) < 10 Тогда
			ДатаКонцаПериода = НВД_ОбщегоНазначения.ДобавитьДень(ДатаНачала, 10) - 1;
		ИначеЕсли День(ДатаНачала) < 20 Тогда
			ДатаКонцаПериода = НВД_ОбщегоНазначения.ДобавитьДень(ДатаНачала, 10) - 1;
		Иначе 
			ДатаКонцаПериода = КонецМесяца(ДатаНачала);
		КонецЕсли;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		//{{Исправлена ошибка, проявлявшаяся, когда месяц начинается в воскресенье
//		Если День(ДатаНачала)<День(КонецНедели(ДатаНачала)) Тогда
		Если День(ДатаНачала)<=День(КонецНедели(ДатаНачала)) Тогда
		//}}	
			ДатаКонцаПериода = КонецНедели(ДатаНачала);
		Иначе
			ДатаКонцаПериода = КонецМесяца(ДатаНачала);
		КонецЕсли;
		
	Иначе	
		ДатаКонцаПериода = ДатаНачала;
	КонецЕсли;
    
    Если УстановитьДату Тогда
 		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаОкончания, ДатаКонцаПериода);
    КонецЕсли; 
    
    Возврат ДатаКонцаПериода;
    
КонецФункции

// +ВасильевИИ МТ 6 мая 2013 г. 15:07:45
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьМассивПериодов(ПериодИерархии, Периодичность) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Периоды.Ссылка
	               |ИЗ
	               |	Справочник.НВД_Периоды КАК Периоды
	               |ГДЕ
	               |	Периоды.Ссылка В ИЕРАРХИИ(&ПериодИерархии)
	               |	И Периоды.Периодичность = &Периодичность
	               |	И Периоды.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Периоды.ДатаНачала";
	Запрос.УстановитьПараметр("ПериодИерархии", ПериодИерархии);
	Запрос.УстановитьПараметр("Периодичность", Периодичность);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ПолучитьМассивПериодов()
